Revit 2027 API
SunAndShadowSettings.IsTimeIntervalValid Method
 Checks whether the time interval is valid for the SunAndShadowType.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsTimeIntervalValid(
	SunStudyTimeInterval interval
)
Public Function IsTimeIntervalValid (
	interval As SunStudyTimeInterval
) As Boolean
public:
bool IsTimeIntervalValid(
	SunStudyTimeInterval interval
)
member IsTimeIntervalValid :
        interval : SunStudyTimeInterval -> bool
Parameters
interval SunStudyTimeInterval
 Time interval value.
Return Value
Boolean
 True if the time interval is valid for the current SunAndShadowType, false otherwise.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
SunAndShadowSettings Class
Autodesk.Revit.DB Namespace